zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt7xx/pinctrl/MIMXRT798SGAWBR-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from MIMXRT798SGAWBR/signal_configuration.xml
 *
 * Copyright 2025, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MIMXRT798SGFOB-pinctrl.h with this part's differences applied
 * below (374 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 0f2d163db779bb12
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT798SGAWBR_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MIMXRT798SGAWBR_WRAPPER_

#include "MIMXRT798SGFOB-pinctrl.h"

/* Signals not present on this part */
#undef ACMP0_IN3_PIO10_16
#undef ACMP0_IN4_PIO10_17
#undef ADC0_CH0_PIO10_15
#undef ADC0_CH5_PIO10_14
#undef CLKCTL0_MCLK_PIO1_19
#undef CLKCTL3_CLKOUT_VDD1_PIO1_2
#undef CTIMER0_CAPTURE0_PIO0_15
#undef CTIMER0_CAPTURE0_PIO1_3
#undef CTIMER0_CAPTURE1_PIO0_15
#undef CTIMER0_CAPTURE1_PIO1_3
#undef CTIMER0_CAPTURE2_PIO0_15
#undef CTIMER0_CAPTURE2_PIO1_3
#undef CTIMER0_CAPTURE3_PIO0_15
#undef CTIMER0_CAPTURE3_PIO1_3
#undef CTIMER0_MATCH0_PIO0_9
#undef CTIMER0_MATCH1_PIO0_16
#undef CTIMER1_CAPTURE0_PIO0_15
#undef CTIMER1_CAPTURE0_PIO1_3
#undef CTIMER1_CAPTURE1_PIO0_15
#undef CTIMER1_CAPTURE1_PIO1_3
#undef CTIMER1_CAPTURE2_PIO0_15
#undef CTIMER1_CAPTURE2_PIO1_3
#undef CTIMER1_CAPTURE3_PIO0_15
#undef CTIMER1_CAPTURE3_PIO1_3
#undef CTIMER1_MATCH0_PIO1_4
#undef CTIMER1_MATCH1_PIO1_5
#undef CTIMER2_CAPTURE0_PIO0_15
#undef CTIMER2_CAPTURE0_PIO1_3
#undef CTIMER2_CAPTURE1_PIO0_15
#undef CTIMER2_CAPTURE1_PIO1_3
#undef CTIMER2_CAPTURE2_PIO0_15
#undef CTIMER2_CAPTURE2_PIO1_3
#undef CTIMER2_CAPTURE3_PIO0_15
#undef CTIMER2_CAPTURE3_PIO1_3
#undef CTIMER2_MATCH0_PIO0_17
#undef CTIMER2_MATCH1_PIO0_18
#undef CTIMER3_CAPTURE0_PIO0_15
#undef CTIMER3_CAPTURE0_PIO1_3
#undef CTIMER3_CAPTURE1_PIO0_15
#undef CTIMER3_CAPTURE1_PIO1_3
#undef CTIMER3_CAPTURE2_PIO0_15
#undef CTIMER3_CAPTURE2_PIO1_3
#undef CTIMER3_CAPTURE3_PIO0_15
#undef CTIMER3_CAPTURE3_PIO1_3
#undef CTIMER4_CAPTURE0_PIO0_15
#undef CTIMER4_CAPTURE0_PIO1_3
#undef CTIMER4_CAPTURE1_PIO0_15
#undef CTIMER4_CAPTURE1_PIO1_3
#undef CTIMER4_CAPTURE2_PIO0_15
#undef CTIMER4_CAPTURE2_PIO1_3
#undef CTIMER4_CAPTURE3_PIO0_15
#undef CTIMER4_CAPTURE3_PIO1_3
#undef CTIMER4_MATCH1_PIO1_19
#undef CTIMER4_MATCH3_PIO1_2
#undef CTIMER6_MATCH2_PIO8_27
#undef CTIMER6_MATCH3_PIO8_28
#undef CTIMER_C_INP3_PIO0_15
#undef CTIMER_C_INP8_PIO1_3
#undef EZHV_PIO20_PIO3_4
#undef EZHV_PIO21_PIO3_5
#undef EZHV_PIO22_PIO3_6
#undef EZHV_PIO23_PIO3_7
#undef EZHV_PIO24_PIO3_8
#undef EZHV_PIO25_PIO3_9
#undef EZHV_PIO26_PIO3_10
#undef EZHV_PIO27_PIO3_11
#undef FLEXIO_TRIG0_PIO0_15
#undef FLEXIO_TRIG1_PIO0_15
#undef FLEXIO_TRIG2_PIO0_15
#undef FLEXIO_TRIG3_PIO0_15
#undef FREQME_IN0_PIO1_19
#undef FREQME_IN1_PIO1_19
#undef GPIO0_GPIO15_PIO0_15
#undef GPIO0_GPIO16_PIO0_16
#undef GPIO0_GPIO17_PIO0_17
#undef GPIO0_GPIO18_PIO0_18
#undef GPIO0_GPIO9_PIO0_9
#undef GPIO10_GPIO14_PIO10_14
#undef GPIO10_GPIO15_PIO10_15
#undef GPIO10_GPIO16_PIO10_16
#undef GPIO10_GPIO17_PIO10_17
#undef GPIO1_GPIO19_PIO1_19
#undef GPIO1_GPIO2_PIO1_2
#undef GPIO1_GPIO3_PIO1_3
#undef GPIO1_GPIO4_PIO1_4
#undef GPIO1_GPIO5_PIO1_5
#undef GPIO3_GPIO10_PIO3_10
#undef GPIO3_GPIO11_PIO3_11
#undef GPIO3_GPIO4_PIO3_4
#undef GPIO3_GPIO5_PIO3_5
#undef GPIO3_GPIO6_PIO3_6
#undef GPIO3_GPIO7_PIO3_7
#undef GPIO3_GPIO8_PIO3_8
#undef GPIO3_GPIO9_PIO3_9
#undef GPIO6_GPIO0_PIO6_0
#undef GPIO6_GPIO10_PIO6_10
#undef GPIO6_GPIO11_PIO6_11
#undef GPIO6_GPIO12_PIO6_12
#undef GPIO6_GPIO1_PIO6_1
#undef GPIO6_GPIO2_PIO6_2
#undef GPIO6_GPIO3_PIO6_3
#undef GPIO6_GPIO4_PIO6_4
#undef GPIO6_GPIO5_PIO6_5
#undef GPIO6_GPIO6_PIO6_6
#undef GPIO6_GPIO7_PIO6_7
#undef GPIO6_GPIO8_PIO6_8
#undef GPIO6_GPIO9_PIO6_9
#undef GPIO7_GPIO24_PIO7_24
#undef GPIO8_GPIO27_PIO8_27
#undef GPIO8_GPIO28_PIO8_28
#undef I3C0_PUR_PIO3_6
#undef I3C1_PUR_PIO3_11
#undef LPSPI14_PCS1_PIO3_6
#undef LPSPI14_PCS2_PIO3_5
#undef LPSPI14_PCS3_PIO3_4
#undef LP_FLEXCOMM0_P2_PIO3_7
#undef LP_FLEXCOMM0_P3_PIO1_2
#undef LP_FLEXCOMM0_P3_PIO3_8
#undef LP_FLEXCOMM0_P4_PIO1_3
#undef LP_FLEXCOMM0_P4_PIO3_4
#undef LP_FLEXCOMM0_P5_PIO1_4
#undef LP_FLEXCOMM0_P5_PIO3_5
#undef LP_FLEXCOMM0_P6_PIO1_5
#undef LP_FLEXCOMM0_P6_PIO3_6
#undef LP_FLEXCOMM10_P0_PIO6_1
#undef LP_FLEXCOMM10_P1_PIO6_2
#undef LP_FLEXCOMM10_P2_PIO6_3
#undef LP_FLEXCOMM10_P3_PIO6_4
#undef LP_FLEXCOMM10_P4_PIO6_5
#undef LP_FLEXCOMM10_P5_PIO6_6
#undef LP_FLEXCOMM10_P6_PIO6_7
#undef LP_FLEXCOMM11_P0_PIO6_10
#undef LP_FLEXCOMM11_P1_PIO6_11
#undef LP_FLEXCOMM11_P2_PIO6_8
#undef LP_FLEXCOMM11_P3_PIO6_9
#undef LP_FLEXCOMM13_P0_PIO6_8
#undef LP_FLEXCOMM13_P1_PIO6_9
#undef LP_FLEXCOMM13_P2_PIO6_10
#undef LP_FLEXCOMM13_P3_PIO6_11
#undef LP_FLEXCOMM13_P4_PIO7_24
#undef LP_FLEXCOMM19_P4_PIO8_27
#undef LP_FLEXCOMM19_P5_PIO8_28
#undef LP_FLEXCOMM1_P5_PIO0_9
#undef LP_FLEXCOMM2_P5_PIO0_15
#undef LP_FLEXCOMM2_P6_PIO0_16
#undef LP_FLEXCOMM3_P2_PIO3_4
#undef LP_FLEXCOMM3_P3_PIO1_19
#undef LP_FLEXCOMM3_P3_PIO3_5
#undef LP_FLEXCOMM3_P4_PIO3_9
#undef LP_FLEXCOMM3_P5_PIO3_10
#undef LP_FLEXCOMM4_P6_PIO0_9
#undef LP_FLEXCOMM5_P5_PIO0_15
#undef LP_FLEXCOMM5_P5_PIO3_7
#undef LP_FLEXCOMM5_P6_PIO0_16
#undef LP_FLEXCOMM5_P6_PIO3_8
#undef LP_FLEXCOMM6_P2_PIO3_9
#undef LP_FLEXCOMM6_P3_PIO3_10
#undef LP_FLEXCOMM6_P4_PIO3_11
#undef LP_FLEXCOMM6_P5_PIO0_17
#undef LP_FLEXCOMM6_P6_PIO0_18
#undef LP_FLEXCOMM7_P2_PIO6_0
#undef LP_FLEXCOMM9_P2_PIO3_6
#undef LP_FLEXCOMM9_P3_PIO1_4
#undef LP_FLEXCOMM9_P3_PIO3_11
#undef LP_FLEXCOMM9_P4_PIO1_5
#undef LP_FLEXCOMM9_P5_PIO1_2
#undef LP_FLEXCOMM9_P6_PIO1_3
#undef PDM_DATA0_PIO10_14
#undef PDM_DATA1_PIO10_15
#undef PDM_DATA2_PIO10_16
#undef PDM_DATA3_PIO10_17
#undef PINT0_PINT0_PIO0_15
#undef PINT0_PINT0_PIO0_16
#undef PINT0_PINT0_PIO0_17
#undef PINT0_PINT0_PIO0_18
#undef PINT0_PINT0_PIO0_9
#undef PINT0_PINT0_PIO1_19
#undef PINT0_PINT0_PIO1_2
#undef PINT0_PINT0_PIO1_3
#undef PINT0_PINT0_PIO1_4
#undef PINT0_PINT0_PIO1_5
#undef PINT0_PINT1_PIO0_15
#undef PINT0_PINT1_PIO0_16
#undef PINT0_PINT1_PIO0_17
#undef PINT0_PINT1_PIO0_18
#undef PINT0_PINT1_PIO0_9
#undef PINT0_PINT1_PIO1_19
#undef PINT0_PINT1_PIO1_2
#undef PINT0_PINT1_PIO1_3
#undef PINT0_PINT1_PIO1_4
#undef PINT0_PINT1_PIO1_5
#undef PINT0_PINT2_PIO0_15
#undef PINT0_PINT2_PIO0_16
#undef PINT0_PINT2_PIO0_17
#undef PINT0_PINT2_PIO0_18
#undef PINT0_PINT2_PIO0_9
#undef PINT0_PINT2_PIO1_19
#undef PINT0_PINT2_PIO1_2
#undef PINT0_PINT2_PIO1_3
#undef PINT0_PINT2_PIO1_4
#undef PINT0_PINT2_PIO1_5
#undef PINT0_PINT3_PIO0_15
#undef PINT0_PINT3_PIO0_16
#undef PINT0_PINT3_PIO0_17
#undef PINT0_PINT3_PIO0_18
#undef PINT0_PINT3_PIO0_9
#undef PINT0_PINT3_PIO1_19
#undef PINT0_PINT3_PIO1_2
#undef PINT0_PINT3_PIO1_3
#undef PINT0_PINT3_PIO1_4
#undef PINT0_PINT3_PIO1_5
#undef PINT0_PINT4_PIO0_15
#undef PINT0_PINT4_PIO0_16
#undef PINT0_PINT4_PIO0_17
#undef PINT0_PINT4_PIO0_18
#undef PINT0_PINT4_PIO0_9
#undef PINT0_PINT4_PIO1_19
#undef PINT0_PINT4_PIO1_2
#undef PINT0_PINT4_PIO1_3
#undef PINT0_PINT4_PIO1_4
#undef PINT0_PINT4_PIO1_5
#undef PINT0_PINT5_PIO0_15
#undef PINT0_PINT5_PIO0_16
#undef PINT0_PINT5_PIO0_17
#undef PINT0_PINT5_PIO0_18
#undef PINT0_PINT5_PIO0_9
#undef PINT0_PINT5_PIO1_19
#undef PINT0_PINT5_PIO1_2
#undef PINT0_PINT5_PIO1_3
#undef PINT0_PINT5_PIO1_4
#undef PINT0_PINT5_PIO1_5
#undef PINT0_PINT6_PIO0_15
#undef PINT0_PINT6_PIO0_16
#undef PINT0_PINT6_PIO0_17
#undef PINT0_PINT6_PIO0_18
#undef PINT0_PINT6_PIO0_9
#undef PINT0_PINT6_PIO1_19
#undef PINT0_PINT6_PIO1_2
#undef PINT0_PINT6_PIO1_3
#undef PINT0_PINT6_PIO1_4
#undef PINT0_PINT6_PIO1_5
#undef PINT0_PINT7_PIO0_15
#undef PINT0_PINT7_PIO0_16
#undef PINT0_PINT7_PIO0_17
#undef PINT0_PINT7_PIO0_18
#undef PINT0_PINT7_PIO0_9
#undef PINT0_PINT7_PIO1_19
#undef PINT0_PINT7_PIO1_2
#undef PINT0_PINT7_PIO1_3
#undef PINT0_PINT7_PIO1_4
#undef PINT0_PINT7_PIO1_5
#undef PINT1_PINT0_PIO10_14
#undef PINT1_PINT0_PIO10_15
#undef PINT1_PINT0_PIO10_16
#undef PINT1_PINT0_PIO10_17
#undef PINT1_PINT0_PIO8_27
#undef PINT1_PINT0_PIO8_28
#undef PINT1_PINT1_PIO10_14
#undef PINT1_PINT1_PIO10_15
#undef PINT1_PINT1_PIO10_16
#undef PINT1_PINT1_PIO10_17
#undef PINT1_PINT1_PIO8_27
#undef PINT1_PINT1_PIO8_28
#undef PINT1_PINT2_PIO10_14
#undef PINT1_PINT2_PIO10_15
#undef PINT1_PINT2_PIO10_16
#undef PINT1_PINT2_PIO10_17
#undef PINT1_PINT2_PIO8_27
#undef PINT1_PINT2_PIO8_28
#undef PINT1_PINT3_PIO10_14
#undef PINT1_PINT3_PIO10_15
#undef PINT1_PINT3_PIO10_16
#undef PINT1_PINT3_PIO10_17
#undef PINT1_PINT3_PIO8_27
#undef PINT1_PINT3_PIO8_28
#undef PIN_32KHZ_CLKOUT_PIO1_3
#undef SAI1_RX_BCLK_PIO0_17
#undef SAI1_RX_DATA0_PIO0_18
#undef SAI2_RX_BCLK_PIO0_15
#undef SAI2_RX_SYNC_PIO0_16
#undef SAI3_TX_DATA0_PIO8_27
#undef SAI3_TX_SYNC_PIO8_28
#undef SCT0_IN0_PIO0_15
#undef SCT0_IN0_PIO0_16
#undef SCT0_IN0_PIO0_17
#undef SCT0_IN0_PIO0_18
#undef SCT0_IN0_PIO0_9
#undef SCT0_IN0_PIO1_2
#undef SCT0_IN0_PIO1_3
#undef SCT0_IN0_PIO1_4
#undef SCT0_IN0_PIO1_5
#undef SCT0_IN1_PIO0_15
#undef SCT0_IN1_PIO0_16
#undef SCT0_IN1_PIO0_17
#undef SCT0_IN1_PIO0_18
#undef SCT0_IN1_PIO0_9
#undef SCT0_IN1_PIO1_2
#undef SCT0_IN1_PIO1_3
#undef SCT0_IN1_PIO1_4
#undef SCT0_IN1_PIO1_5
#undef SCT0_IN2_PIO0_15
#undef SCT0_IN2_PIO0_16
#undef SCT0_IN2_PIO0_17
#undef SCT0_IN2_PIO0_18
#undef SCT0_IN2_PIO0_9
#undef SCT0_IN2_PIO1_2
#undef SCT0_IN2_PIO1_3
#undef SCT0_IN2_PIO1_4
#undef SCT0_IN2_PIO1_5
#undef SCT0_IN3_PIO0_15
#undef SCT0_IN3_PIO0_16
#undef SCT0_IN3_PIO0_17
#undef SCT0_IN3_PIO0_18
#undef SCT0_IN3_PIO0_9
#undef SCT0_IN3_PIO1_2
#undef SCT0_IN3_PIO1_3
#undef SCT0_IN3_PIO1_4
#undef SCT0_IN3_PIO1_5
#undef SCT0_IN4_PIO0_15
#undef SCT0_IN4_PIO0_16
#undef SCT0_IN4_PIO0_17
#undef SCT0_IN4_PIO0_18
#undef SCT0_IN4_PIO0_9
#undef SCT0_IN4_PIO1_2
#undef SCT0_IN4_PIO1_3
#undef SCT0_IN4_PIO1_4
#undef SCT0_IN4_PIO1_5
#undef SCT0_IN5_PIO0_15
#undef SCT0_IN5_PIO0_16
#undef SCT0_IN5_PIO0_17
#undef SCT0_IN5_PIO0_18
#undef SCT0_IN5_PIO0_9
#undef SCT0_IN5_PIO1_2
#undef SCT0_IN5_PIO1_3
#undef SCT0_IN5_PIO1_4
#undef SCT0_IN5_PIO1_5
#undef SCT0_IN6_PIO0_15
#undef SCT0_IN6_PIO0_16
#undef SCT0_IN6_PIO0_17
#undef SCT0_IN6_PIO0_18
#undef SCT0_IN6_PIO0_9
#undef SCT0_IN6_PIO1_2
#undef SCT0_IN6_PIO1_3
#undef SCT0_IN6_PIO1_4
#undef SCT0_IN6_PIO1_5
#undef SCT0_OUT0_PIO0_17
#undef SCT0_OUT1_PIO0_18
#undef SCT0_OUT1_PIO0_9
#undef SCT0_OUT2_PIO0_15
#undef SCT0_OUT3_PIO0_16
#undef SCT0_OUT6_PIO1_2
#undef SCT0_OUT7_PIO1_3
#undef SCT0_OUT8_PIO1_4
#undef SCT0_OUT9_PIO1_5
#undef SDADC_INN2_PIO10_15
#undef SDADC_INN3_PIO10_17
#undef SDADC_INP2_PIO10_14
#undef SDADC_INP3_PIO10_16
#undef SDHC1_CARD_DET_N_PIO7_24
#undef USB0_OVERCURRENTN_PIO3_10
#undef USB0_PORTPWRN_PIO3_11
#undef XSPI0_DATA0_PIO6_3
#undef XSPI0_DATA1_PIO6_4
#undef XSPI0_DATA2_PIO6_5
#undef XSPI0_DATA3_PIO6_6
#undef XSPI0_DATA4_PIO6_8
#undef XSPI0_DATA5_PIO6_9
#undef XSPI0_DATA6_PIO6_10
#undef XSPI0_DATA7_PIO6_11
#undef XSPI0_DQS_A_0_PIO6_7
#undef XSPI0_PCS_A_0_PIO6_2
#undef XSPI0_PCS_A_1_PIO6_12
#undef XSPI0_SCK_A_N_PIO6_0
#undef XSPI0_SCK_A_PIO6_1

#endif /* _ZEPHYR_DTS_BINDING_MIMXRT798SGAWBR_WRAPPER_ */
